Информационная_база/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/InformationRegisters/ЗначенияНоменклатурыПоУмолчанию/ЗначенияНоменклатурыПоУмолчанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияНоменклатурыПоУмолчанию</name>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/Catalogs/ХарактеристикиНоменклатуры/ObjectModule.bsl
Перем ЭтоНовыйОбъект;

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("НоменклатураСсылка") Тогда
			
			Владелец = ДанныеЗаполнения.НоменклатураСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка И ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	КатегорииНоменклатурыСервер.ПроверкаЗаполненияСвойствПередЗаписью(ЭтотОбъект, Отказ);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовыйОбъект = ЭтоНовый();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка И ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		Категория = Владелец.КатегорияНоменклатуры;
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.КатегорииНоменклатуры") Тогда
		Категория = Владелец;
	КонецЕсли;
	КатегорииНоменклатурыСервер.ПроверкаЗаполненияСвойствПриЗаписи(ЭтотОбъект, Категория, Отказ);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовыйОбъект и ЭтотОбъект.Владелец.ПроверятьЗаполнениеХарактеристики Тогда
		ИспользоватьКакОсновнуюПервуюХарактеристику(ЭтотОбъект.Ссылка, Отказ);
	КонецЕсли;
	
КонецПроцедуры

//Производит запись в регистр сведений значение характеристики по умолчанию для номенклатуры
//
Процедура ИспользоватьКакОсновную(НоменклатураДляЗаписи, Характеристика, Отказ)
	
	НаборЗаписей = РегистрыСведений.ЗначенияНоменклатурыПоУмолчанию.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(НоменклатураДляЗаписи);
	НаборЗаписей.Прочитать();
	
	Если НЕ НаборЗаписей.Количество()
		Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Номенклатура = НоменклатураДляЗаписи;
		НоваяЗапись.Характеристика = Характеристика;     
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ТекстСообщения = НСтр("ru = 'При записи Характеристики произошла ошибка!
			|Дополнительное описание: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Отказ = Истина;
		КонецПопытки;  	
	КонецЕсли;
	
КонецПроцедуры

//Производит запись в регистр сведений значение характеристики по умолчанию для номенклатуры если это первая характеристика
//
Процедура ИспользоватьКакОсновнуюПервуюХарактеристику(СсылкаНаНовуюХарактеристику, Отказ)
	
	Если ТипЗнч(ЭтотОбъект.Владелец) = Тип("СправочникСсылка.Номенклатура") и ЭтотОбъект.Владелец.ПроверятьЗаполнениеХарактеристики 
		Тогда
		Если КоличествоХарактеристик(ЭтотОбъект.Владелец, ЭтотОбъект.Владелец.КатегорияНоменклатуры) = 1 и НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(ЭтотОбъект.Владелец) = Неопределено
			Тогда
			ИспользоватьКакОсновную(ЭтотОбъект.Владелец,  СсылкаНаНовуюХарактеристику, Отказ);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЭтотОбъект.Владелец) = Тип("СправочникСсылка.КатегорииНоменклатуры") и ЭтотОбъект.Владелец.ПроверятьЗаполнениеХарактеристики
		Тогда
		Если КоличествоХарактеристик(ЭтотОбъект.Владелец) = 1
			Тогда
			ИспользоватьКакОсновную(ЭтотОбъект.Владелец, СсылкаНаНовуюХарактеристику, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Возвращает количество характеристик по владельцу 
//
Функция КоличествоХарактеристик(ВладелецХарактеристики, КатегорияНоменклатуры = Неопределено)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Владелец", ВладелецХарактеристики);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	КоличествоПоВладельцу = Результат.Количество();
	
	КоличествоПоКатегории = 0;
	
	Если Не КатегорияНоменклатуры = Неопределено
		Тогда	
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Владелец", КатегорияНоменклатуры);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
		
		Результат = Запрос.Выполнить().Выбрать();
		
		КоличествоПоКатегории = Результат.Количество();
	КонецЕсли;
	
	Возврат КоличествоПоВладельцу + КоличествоПоКатегории;
	
КонецФункции

#КонецОбласти

#КонецЕсли
